use v1_contract::错误码信息;
pub mod 能力号 {
    pub const 十六进制编解码编码文本: u32 = 4501;
    pub const 十六进制编解码解码文本: u32 = 4502;
}
pub mod 错误码 {
    pub const 十六进制编解码参数不合法: u32 = 4501;
    pub const 十六进制编解码内容不合法: u32 = 4502;
    pub const 十六进制编解码资源受限: u32 = 4503;
}
pub const fn 码项(
    错误码: u32,
    名称: &'static [u8],
    描述: &'static [u8],
    可重试: u8,
    可自愈: u8,
    需人工: u8,
) -> 错误码信息 {
    错误码信息 {
        码值: 错误码,
        段位: 错误码 / 1000,
        名称: 名称.as_ptr(),
        说明: 描述.as_ptr(),
        可重试,
        可自愈,
        需人工,
        保留: 0,
    }
}

pub const 十六进制编解码错误码信息表: [错误码信息; 3] = [
    码项(
        错误码::十六进制编解码参数不合法,
        "十六进制编解码参数不合法\0".as_bytes(),
        "十六进制编解码参数不合法\0".as_bytes(),
        0,
        0,
        0,
    ),
    码项(
        错误码::十六进制编解码内容不合法,
        "十六进制编解码内容不合法\0".as_bytes(),
        "十六进制编解码内容不合法\0".as_bytes(),
        0,
        0,
        0,
    ),
    码项(
        错误码::十六进制编解码资源受限,
        "十六进制编解码资源受限\0".as_bytes(),
        "十六进制编解码资源受限\0".as_bytes(),
        0,
        0,
        0,
    ),
];

