use v1_contract::执行函数;
pub const 函数表项数: usize = 10;
const _: () = assert!(函数表项数 == crate::命令声明面::命令表项数);
pub const fn 造函数表() -> [执行函数; 10] {
    [
        crate::字符编解码::执行函数面::执行函数表[0],
        crate::字符编解码::执行函数面::执行函数表[1],
        crate::URI组件编解码::执行函数面::执行函数表[0],
        crate::URI组件编解码::执行函数面::执行函数表[1],
        crate::Base64编解码::执行函数面::执行函数表[0],
        crate::Base64编解码::执行函数面::执行函数表[1],
        crate::Base64编解码::执行函数面::执行函数表[2],
        crate::Base64编解码::执行函数面::执行函数表[3],
        crate::十六进制编解码::执行函数面::执行函数表[0],
        crate::十六进制编解码::执行函数面::执行函数表[1],
    ]
}
pub(crate) const 执行函数表: [执行函数; 函数表项数] = 造函数表();
