use v1_contract::错误码信息;
pub const fn 造错误码表() -> [错误码信息; 12] {
    let [BASE64编解码参数不合法错误, BASE64编解码内容不合法错误, BASE64编解码资源受限错误] = crate::Base64编解码::编号与码面::BASE64编解码错误码信息表;
    let [十六进制编解码参数不合法错误, 十六进制编解码内容不合法错误, 十六进制编解码资源受限错误] = crate::十六进制编解码::编号与码面::十六进制编解码错误码信息表;
    let [字符编解码参数不合法错误, 字符编解码内容不合法错误, 字符编解码资源受限错误] = crate::字符编解码::编号与码面::字符编解码错误码信息表;
    let [URI组件编解码编码参数不合法错误, URI组件编解码编码执行失败错误, URI组件编解码编码资源受限错误] = crate::URI组件编解码::编号与码面::URI组件编解码错误码信息表;
    [字符编解码参数不合法错误, 字符编解码内容不合法错误, 字符编解码资源受限错误, URI组件编解码编码参数不合法错误, URI组件编解码编码执行失败错误, URI组件编解码编码资源受限错误, BASE64编解码参数不合法错误, BASE64编解码内容不合法错误, BASE64编解码资源受限错误, 十六进制编解码参数不合法错误, 十六进制编解码内容不合法错误, 十六进制编解码资源受限错误]
}
pub const 错误码信息表: [错误码信息; 12] = 造错误码表();
pub const fn 错误码信息表段() -> v1_contract::表段<错误码信息> { v1_contract::表段::构造(错误码信息表.as_ptr(), 12) }
